"""
📌 Создайте модуль с функцией внутри.
📌 Функция принимает на вход три целых числа: нижнюю и верхнюю границу и количество попыток.
📌 Внутри генерируется случайное число в указанных границах и пользователь должен угадать его за заданное число
попыток.
📌 Функция выводит подсказки “больше” и “меньше”.
📌 Если число угадано, возвращается истина, а если попытки исчерпаны - ложь.
****************************************************************************************************************
📌 Улучшаем задачу 2.
📌 Добавьте возможность запуска функции “угадайки” из модуля в командной строке терминала.
📌 Строка должна принимать от 1 до 3 аргументов: параметры вызова функции.
📌 Для преобразования строковых аргументов командной строки в числовые параметры используйте генераторное выражение.
"""

from random import randint
from sys import argv


def num_guess(a=0, b=10, counts=5) -> bool:
    num = randint(a, b + 1)
    user_num = None
    counter = 0
    while num != user_num and counts > counter:
        user_num = int(input("Guess the num:\n>>> "))
        if user_num == num:
            return True
        elif user_num < num:
            print("Your num is lesser")
        else:
            print("Your num is greater")
        counter += 1
    return False


if __name__ == '__main__':
    print(num_guess(*(int(i) for i in argv[1:])))
